{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Brenda Goodman", "title": "The threat of respiratory illnesses is underway, CDC director says, and hospitalizations are on the rise | CNN", "description": "Dr. Mandy Cohen, director of the US Centers for Disease Control and Prevention, updated a congressional subcommittee Thursday about cases of respiratory illness in the US due to three viruses: flu, the coronavirus and respiratory syncytial virus, or RSV.", "url": "https://www.cnn.com/2023/11/30/health/mandy-cohen-respiratory-viruses/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/231130165007-mandy-cohen-testify-113023.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-12-01T02:08:19Z", "content": "Dr. Mandy Cohen, director of the US Centers for Disease Control and Prevention, updated a congressional subcommittee Thursday about cases of respiratory illness in the US due to three viruses: flu, t… [+3137 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Samantha Delouya", "title": "Judge blocks Montana’s TikTok ban from taking effect on January 1 | CNN Business", "description": "A federal judge on Thursday halted Montana’s TikTok ban, which was set to go into effect at the start of 2024.", "url": "https://www.cnn.com/2023/11/30/business/judge-blocks-montana-tiktok-ban/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230316215418-01-tiktok-offices-031623-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-12-01T01:22:26Z", "content": "A federal judge on Thursday temporarily halted Montanas groundbreaking statewide TikTok ban, which was set to go into effect at the start of 2024, pending a trial on the matter.\r\nIn an order, US Dist… [+3584 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "cnn", "title": "Biden campaign prepares legal fight against election deepfakes...", "description": "President Joe Biden’s 2024 campaign has assembled a special task force to ready its responses to misleading AI-generated images and videos, drafting court filings and preparing novel legal theories it could deploy to counter potential disinformation efforts t…", "url": "https://www.cnn.com/2023/11/30/politics/biden-campaign-prepares-against-deepfakes/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/44f5d015-a5ce-4331-a211-f015ee83d281.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-12-01T01:00:03Z", "content": "First on CNN: Biden campaign prepares legal fight against election deepfakes | CNN Politics President Joe Biden’s 2024 campaign has assembled a special task force to ready its responses to misleading… [+8489 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tom Page", "title": "Not so dead as a dodo: ‘De-extinction’ plan to reintroduce bird to Mauritius | CNN", "description": "A collaboration between Colossal Biosciences and conservationists plans to bring back the extinct dodo and reintroduce it to its once-native habitat in Mauritius.", "url": "https://www.cnn.com/dodo-de-extinction-mauritius-spc-intl-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/231124114153-dodo-rendering-colossal-biosciences-thumb.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-12-01T00:48:28Z", "content": "An audacious collaboration between geneticists and conservationistsplans to bring back the extinct dodo and reintroduce it to its once-native habitat in Mauritius.\r\nUS-based biotechnology and genetic… [+8552 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan", "title": "Black Lives Matter distances itself from activist’s endorsement of Trump | CNN Politics", "description": "The national Black Lives Matter organization on Thursday dismissed as an “imposter” an activist who identified himself as a leader of the movement in Rhode Island and declared he was backing Donald Trump for president.", "url": "https://www.cnn.com/2023/11/30/politics/black-lives-matter-trump-endorsement/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/231130185625-black-lives-matter-signs-113023.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-12-01T00:14:54Z", "content": "The national Black Lives Matter organization on Thursday dismissed as an imposter an activist who identified himself as a leader of the movement in Rhode Island and declared he was backing Donald Tru… [+2329 chars]"}]}